ELPasEDT/src/DataProcessors/ЗаполнениеДатыКонтроляЗнаний/ЗаполнениеДатыКонтроляЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗаполнениеДатыКонтроляЗнаний</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокСотрудников</name>
    <attributes>
      <name>Использовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКонтроляЗнаний</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ELPasEDT/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКонтроляЗнаний</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НСС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НСЦ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Уволен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Архив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодЕСС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЕСС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонЕСС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛогинЕСС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеЕСС</name>
    <type>
      <types>CatalogRef.ПодразделениеЕСС</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияЕСС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочтаЕСС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьЕСС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияЕСС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ELPasEDT/src/DataProcessors/ЗаполнениеДатыКонтроляЗнаний/Forms/Форма/Module.bsl
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФизическиеЛица.Ссылка КАК Сотрудник,
		|	ФизическиеЛица.ДатаКонтроляЗнаний КАК ДатаКонтроляЗнаний
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	ИСТИНА
		|	И НЕ ФизическиеЛица.Уволен";
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда 
		Запрос.Текст = Запрос.Текст + " И ФизическиеЛица.Подразделение.Организация = &Организация ";
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда 
		Запрос.Текст = Запрос.Текст + " И ФизическиеЛица.Подразделение = &Подразделение";
		Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "		
	    |
		|УПОРЯДОЧИТЬ ПО
		|	ФизическиеЛица.Наименование";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Объект.СписокСотрудников.Очистить();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = Объект.СписокСотрудников.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбработкуНаСервере()
	УстановитьПривилегированныйРежим(Истина);
	Для каждого ТекСтрока Из Объект.СписокСотрудников Цикл
		Если ТекСтрока.Использовать Тогда 
			СотрудникОбъект = ТекСтрока.Сотрудник.ПолучитьОбъект();
			СотрудникОбъект.ДатаКонтроляЗнаний = ТекСтрока.ДатаКонтроляЗнаний;
			СотрудникОбъект.Обменданными.Загрузка = Истина;
			СотрудникОбъект.Записать();
		КонецЕсли;
	КонецЦикла;		
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	ВыполнитьОбработкуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПометитьВсе(Команда)
	
	Для каждого ТекСтрока Из Объект.СписокСотрудников Цикл
		ТекСтрока.Использовать = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	Для каждого ТекСтрока Из Объект.СписокСотрудников Цикл
		ТекСтрока.Использовать = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СписокСотрудниковДатаКонтроляЗнанийПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокСотрудников.ТекущиеДанные;
	ТекущиеДанные.Использовать = ЗначениеЗаполнено(ТекущиеДанные.ДатаКонтроляЗнаний);
	
КонецПроцедуры
